#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

        id         = "37fa7367-0537-4443-8bf1-97027c185a0a"
        name       = "PRP_MSPQI"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PRP_PMP"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "6b319a0b-1e92-4e0a-94fb-b2ca19c86782"
        name       = "PRP_PMP"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PRP_ReportProgram_MSPQI"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "38501b34-8d99-44b4-88a0-08e7d453e756"
        name       = "PRP_ReportProgram_MSPQI"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PRP_ReportProgram_PMP"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "a1dab1e8-c0be-4204-b74b-6d73c8a952cd"
        name       = "PRP_ReportProgram_PMP"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PRP_ReportSection_MSPQI"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "07f6fb44-31ba-47d1-93b5-f4156dd31a9e"
        name       = "PRP_ReportSection_MSPQI"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-SERVICE.module.client-roles.keycloak_role.ROLES["PRP_ReportSection_PMP"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "a28c990e-5ac7-42db-a104-e434bbe41db4"
        name       = "PRP_ReportSection_PMP"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-prp-service"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "6e96c9d1-5a15-4628-9429-f2d1d07648fa"
        name       = "view-client-prp-service"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-USER-ADMIN.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "PRP User Admin"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PRP-USER-ADMIN.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = [
          + "0a96d3fa-66b7-4f16-8dd7-276ce53be553",
          + "0b6e1b8b-dcb3-4da5-be8c-c74a377426c1",
          + "197b2f83-cdec-4585-939f-bc19bebdf802",
          + "25b73a09-5c9f-40a7-914e-c1108c61cc2e",
          + "30082a96-b600-4b97-83ee-8f622b28f6c7",
          + "414d1083-7d48-42e3-84d9-c9e6cf4b9b89",
          + "6e96c9d1-5a15-4628-9429-f2d1d07648fa",
          + "767bb2ee-f967-4718-ad7e-6414880253a2",
          + "79885676-48f2-43af-ade4-bc4f11d95f61",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*